Revit 2027 API
IExternalDataManagerServer Methods
The IExternalDataManagerServer type exposes the following members.
Methods
Name | Description
GetCommandsForAdd |  Retrieves commands in the Add menu.
GetContentTools |  Obtains the content tool items of the selected data
GetData |  Obtains the data.
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetPreviewImage |  Retrieves the handle of preview image.
GetPreviewImageFile |  Retrieves the handle of preview image.
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetTitle |  Obtains the title for the external data.
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
IsCommandEnabled |  Checks if the command is enabled.
IsEnabledInFamilyDocuments |  Checks if the data type enabled in family documents.
OnCommand |  Handles user command.
Top
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace